zephyrproject-rtos/hal_microchip/pic32cxsg/mplabx/pic32cxsg/include/pic32cxsg41/component/sdhc.h
/* -------- SDHC_EISTR : (SDHC Offset: 0x32) (R/W 16) Error Interrupt Status -------- */
#define SDHC_EISTR_RESETVALUE                 _UINT16_(0x00)                                       /*  (SDHC_EISTR) Error Interrupt Status  Reset Value */

#define SDHC_EISTR_CMDTEO_Pos                 _UINT16_(0)                                          /* (SDHC_EISTR) Command Timeout Error Position */
#define SDHC_EISTR_CMDTEO_Msk                 (_UINT16_(0x1) << SDHC_EISTR_CMDTEO_Pos)             /* (SDHC_EISTR) Command Timeout Error Mask */
#define SDHC_EISTR_CMDTEO(value)              (SDHC_EISTR_CMDTEO_Msk & (_UINT16_(value) << SDHC_EISTR_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_EISTR register */
#define   SDHC_EISTR_CMDTEO_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDTEO_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Timeout  */
#define SDHC_EISTR_CMDTEO_NO                  (SDHC_EISTR_CMDTEO_NO_Val << SDHC_EISTR_CMDTEO_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDTEO_YES                 (SDHC_EISTR_CMDTEO_YES_Val << SDHC_EISTR_CMDTEO_Pos) /* (SDHC_EISTR) Timeout Position  */
#define SDHC_EISTR_CMDCRC_Pos                 _UINT16_(1)                                          /* (SDHC_EISTR) Command CRC Error Position */
#define SDHC_EISTR_CMDCRC_Msk                 (_UINT16_(0x1) << SDHC_EISTR_CMDCRC_Pos)             /* (SDHC_EISTR) Command CRC Error Mask */
#define SDHC_EISTR_CMDCRC(value)              (SDHC_EISTR_CMDCRC_Msk & (_UINT16_(value) << SDHC_EISTR_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_EISTR register */
#define   SDHC_EISTR_CMDCRC_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDCRC_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) CRC Error Generated  */
#define SDHC_EISTR_CMDCRC_NO                  (SDHC_EISTR_CMDCRC_NO_Val << SDHC_EISTR_CMDCRC_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDCRC_YES                 (SDHC_EISTR_CMDCRC_YES_Val << SDHC_EISTR_CMDCRC_Pos) /* (SDHC_EISTR) CRC Error Generated Position  */
#define SDHC_EISTR_CMDEND_Pos                 _UINT16_(2)                                          /* (SDHC_EISTR) Command End Bit Error Position */
#define SDHC_EISTR_CMDEND_Msk                 (_UINT16_(0x1) << SDHC_EISTR_CMDEND_Pos)             /* (SDHC_EISTR) Command End Bit Error Mask */
#define SDHC_EISTR_CMDEND(value)              (SDHC_EISTR_CMDEND_Msk & (_UINT16_(value) << SDHC_EISTR_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_EISTR register */
#define   SDHC_EISTR_CMDEND_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No error  */
#define   SDHC_EISTR_CMDEND_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) End Bit Error Generated  */
#define SDHC_EISTR_CMDEND_NO                  (SDHC_EISTR_CMDEND_NO_Val << SDHC_EISTR_CMDEND_Pos)  /* (SDHC_EISTR) No error Position  */
#define SDHC_EISTR_CMDEND_YES                 (SDHC_EISTR_CMDEND_YES_Val << SDHC_EISTR_CMDEND_Pos) /* (SDHC_EISTR) End Bit Error Generated Position  */
#define SDHC_EISTR_CMDIDX_Pos                 _UINT16_(3)                                          /* (SDHC_EISTR) Command Index Error Position */
#define SDHC_EISTR_CMDIDX_Msk                 (_UINT16_(0x1) << SDHC_EISTR_CMDIDX_Pos)             /* (SDHC_EISTR) Command Index Error Mask */
#define SDHC_EISTR_CMDIDX(value)              (SDHC_EISTR_CMDIDX_Msk & (_UINT16_(value) << SDHC_EISTR_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_EISTR register */
#define   SDHC_EISTR_CMDIDX_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDIDX_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Error  */
#define SDHC_EISTR_CMDIDX_NO                  (SDHC_EISTR_CMDIDX_NO_Val << SDHC_EISTR_CMDIDX_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDIDX_YES                 (SDHC_EISTR_CMDIDX_YES_Val << SDHC_EISTR_CMDIDX_Pos) /* (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_DATTEO_Pos                 _UINT16_(4)                                          /* (SDHC_EISTR) Data Timeout Error Position */
#define SDHC_EISTR_DATTEO_Msk                 (_UINT16_(0x1) << SDHC_EISTR_DATTEO_Pos)             /* (SDHC_EISTR) Data Timeout Error Mask */
#define SDHC_EISTR_DATTEO(value)              (SDHC_EISTR_DATTEO_Msk & (_UINT16_(value) << SDHC_EISTR_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_EISTR register */
#define   SDHC_EISTR_DATTEO_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATTEO_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Timeout  */
#define SDHC_EISTR_DATTEO_NO                  (SDHC_EISTR_DATTEO_NO_Val << SDHC_EISTR_DATTEO_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATTEO_YES                 (SDHC_EISTR_DATTEO_YES_Val << SDHC_EISTR_DATTEO_Pos) /* (SDHC_EISTR) Timeout Position  */
#define SDHC_EISTR_DATCRC_Pos                 _UINT16_(5)                                          /* (SDHC_EISTR) Data CRC Error Position */
#define SDHC_EISTR_DATCRC_Msk                 (_UINT16_(0x1) << SDHC_EISTR_DATCRC_Pos)             /* (SDHC_EISTR) Data CRC Error Mask */
#define SDHC_EISTR_DATCRC(value)              (SDHC_EISTR_DATCRC_Msk & (_UINT16_(value) << SDHC_EISTR_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_EISTR register */
#define   SDHC_EISTR_DATCRC_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATCRC_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Error  */
#define SDHC_EISTR_DATCRC_NO                  (SDHC_EISTR_DATCRC_NO_Val << SDHC_EISTR_DATCRC_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATCRC_YES                 (SDHC_EISTR_DATCRC_YES_Val << SDHC_EISTR_DATCRC_Pos) /* (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_DATEND_Pos                 _UINT16_(6)                                          /* (SDHC_EISTR) Data End Bit Error Position */
#define SDHC_EISTR_DATEND_Msk                 (_UINT16_(0x1) << SDHC_EISTR_DATEND_Pos)             /* (SDHC_EISTR) Data End Bit Error Mask */
#define SDHC_EISTR_DATEND(value)              (SDHC_EISTR_DATEND_Msk & (_UINT16_(value) << SDHC_EISTR_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_EISTR register */
#define   SDHC_EISTR_DATEND_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATEND_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Error  */
#define SDHC_EISTR_DATEND_NO                  (SDHC_EISTR_DATEND_NO_Val << SDHC_EISTR_DATEND_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATEND_YES                 (SDHC_EISTR_DATEND_YES_Val << SDHC_EISTR_DATEND_Pos) /* (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_CURLIM_Pos                 _UINT16_(7)                                          /* (SDHC_EISTR) Current Limit Error Position */
#define SDHC_EISTR_CURLIM_Msk                 (_UINT16_(0x1) << SDHC_EISTR_CURLIM_Pos)             /* (SDHC_EISTR) Current Limit Error Mask */
#define SDHC_EISTR_CURLIM(value)              (SDHC_EISTR_CURLIM_Msk & (_UINT16_(value) << SDHC_EISTR_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_EISTR register */
#define   SDHC_EISTR_CURLIM_NO_Val            _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CURLIM_YES_Val           _UINT16_(0x1)                                        /* (SDHC_EISTR) Power Fail  */
#define SDHC_EISTR_CURLIM_NO                  (SDHC_EISTR_CURLIM_NO_Val << SDHC_EISTR_CURLIM_Pos)  /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CURLIM_YES                 (SDHC_EISTR_CURLIM_YES_Val << SDHC_EISTR_CURLIM_Pos) /* (SDHC_EISTR) Power Fail Position  */
#define SDHC_EISTR_ACMD_Pos                   _UINT16_(8)                                          /* (SDHC_EISTR) Auto CMD Error Position */
#define SDHC_EISTR_ACMD_Msk                   (_UINT16_(0x1) << SDHC_EISTR_ACMD_Pos)               /* (SDHC_EISTR) Auto CMD Error Mask */
#define SDHC_EISTR_ACMD(value)                (SDHC_EISTR_ACMD_Msk & (_UINT16_(value) << SDHC_EISTR_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_EISTR register */
#define   SDHC_EISTR_ACMD_NO_Val              _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_ACMD_YES_Val             _UINT16_(0x1)                                        /* (SDHC_EISTR) Error  */
#define SDHC_EISTR_ACMD_NO                    (SDHC_EISTR_ACMD_NO_Val << SDHC_EISTR_ACMD_Pos)      /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_ACMD_YES                   (SDHC_EISTR_ACMD_YES_Val << SDHC_EISTR_ACMD_Pos)     /* (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_ADMA_Pos                   _UINT16_(9)                                          /* (SDHC_EISTR) ADMA Error Position */
#define SDHC_EISTR_ADMA_Msk                   (_UINT16_(0x1) << SDHC_EISTR_ADMA_Pos)               /* (SDHC_EISTR) ADMA Error Mask */
#define SDHC_EISTR_ADMA(value)                (SDHC_EISTR_ADMA_Msk & (_UINT16_(value) << SDHC_EISTR_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_EISTR register */
#define   SDHC_EISTR_ADMA_NO_Val              _UINT16_(0x0)                                        /* (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_ADMA_YES_Val             _UINT16_(0x1)                                        /* (SDHC_EISTR) Error  */
#define SDHC_EISTR_ADMA_NO                    (SDHC_EISTR_ADMA_NO_Val << SDHC_EISTR_ADMA_Pos)      /* (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_ADMA_YES                   (SDHC_EISTR_ADMA_YES_Val << SDHC_EISTR_ADMA_Pos)     /* (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_Msk                        _UINT16_(0x03FF)                                     /* (SDHC_EISTR) Register Mask  */

/* EMMC mode */
#define SDHC_EISTR_EMMC_BOOTAE_Pos            _UINT16_(12)                                         /* (SDHC_EISTR) Boot Acknowledge Error Position */
#define SDHC_EISTR_EMMC_BOOTAE_Msk            (_UINT16_(0x1) << SDHC_EISTR_EMMC_BOOTAE_Pos)        /* (SDHC_EISTR) Boot Acknowledge Error Mask */
#define SDHC_EISTR_EMMC_BOOTAE(value)         (SDHC_EISTR_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDHC_EISTR_EMMC_BOOTAE_Pos))
#define   SDHC_EISTR_EMMC_BOOTAE_FIFONOTEMPTY_Val _UINT16_(0x0)                                        /* (SDHC_EISTR) FIFO contains at least one byte  */
#define   SDHC_EISTR_EMMC_BOOTAE_FIFOEMPTY_Val _UINT16_(0x1)                                        /* (SDHC_EISTR) FIFO is empty  */
#define SDHC_EISTR_EMMC_BOOTAE_FIFONOTEMPTY   (SDHC_EISTR_EMMC_BOOTAE_FIFONOTEMPTY_Val << SDHC_EISTR_EMMC_BOOTAE_Pos) /* (SDHC_EISTR) FIFO contains at least one byte Position  */
#define SDHC_EISTR_EMMC_BOOTAE_FIFOEMPTY      (SDHC_EISTR_EMMC_BOOTAE_FIFOEMPTY_Val << SDHC_EISTR_EMMC_BOOTAE_Pos) /* (SDHC_EISTR) FIFO is empty Position  */
#define SDHC_EISTR_EMMC_Msk                   _UINT16_(0x1000)                                      /* (SDHC_EISTR_EMMC) Register Mask  */


